#+Title: Anotacoes
#+Subtitle:

* Configurando o banco de dados da aplicacao
   
  Primeiro tem que criar o banco. Estamos utilizando lpcg como nome do banco

   #+NAME: psql -U postgres -W -h localhost -c "CREATE DATABASE lpcg"                    
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      psql -U postgres -W -h localhost -c "CREATE DATABASE lpcg"
   #+END_SRC

   #+RESULTS: psql -U postgres -W -h localhost -c "CREATE DATABASE lpcg"
   : 
   : Senha: 
   : CREATE DATABASE

   #+NAME: psql -U postgres -h localhost -W  -d lpcg -c res/create_db.sql                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      psql -U postgres -h localhost -W  -d lpcg -a- -f res/create_db.sql      
   #+END_SRC

   #+RESULTS: psql -U postgres -h localhost -W  -d lpcg -c res/create_db.sql
   #+begin_example

   Senha: 
   create table polos(
     id serial primary key,
     nome varchar(50) not null
   );
   CREATE TABLE
   create table alunos(
      id serial primary key,
      nome varchar(100) not null,
      dta_nasc date,
      sexo varchar (10),
      rg int (10),
      escolaridade varchar(30),
      cidade varchar(100),
      estado varchar(10),
      cep varchar(10),
      endereco varchar(100),
      bairro varchar(30),
      celular varchar(13),
      telefone varchar(13),
      email varchar(50) not null,
      profissao varchar(50),
      ocupacao varchar(50),
      local_trabalho varchar(100),
      senha varchar(15) not null,
      resp boolean not null,
      fk_polo int not null,
      foreign key (fk_polo) references polos(id)
   );
   psql:res/create_db.sql:28: ERROR:  syntax error at or near "("
   LINHA 6:    rg int (10),
                      ^
   create table frequencia(
      id serial primary key,
      data date not null,
      presenca boolean not null,
      fk_lista int not null,
      foreign key (fk_lista) references lista(id)
   );
   psql:res/create_db.sql:38: ERROR:  relation "lista" does not exist
   #+end_example


   


* Pra rodar a aplicação
  Por enquanto esta previsto essas maneiras

  
   #+NAME:node src/main.js env=devlocal
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      node src/main.js env=devlocal
   #+END_SRC
  
   
   #+NAME:npm startDevLocal        
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      npm startDevLocal
   #+END_SRC
  
   
   #+NAME:                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      grunt clean concat uglify copy 
   #+END_SRC

   
   #+NAME:                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      grunt exec:test
   #+END_SRC

* Rodar testes
  npm test


* Sobre o diretorio env
  Qdo rodar o software podemos passar o argumento env=devlocal por
  exemplo. Isso faz o modulo env/environment.js carregar o arquivo de
  propriedade devlocal.props o que define parametros como nome de
  usuarios e senha.
  No momento essas credenciis sao utilizadas para conecar no banco de
  dados.


* Qualidade do codigo
  rode grunt exec:eslint pra ver o que he necessario pra melhorar a
  qualidade do codigo.
  
   #+NAME:                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      grunt exec:eslint
   #+END_SRC

   #+RESULTS: 
   #+begin_example

   [wagner@localhost lpcg]$ Running "exec:eslint" (exec) task

   /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/lpcg/src/main.js
      4:80  warning  Missing semicolon                                 semi
      5:7   error    'env' is assigned a value but never used          no-unused-vars
      8:5   error    'persistence' is assigned a value but never used  no-unused-vars
     11:13  warning  Strings must use doublequote                      quotes
     12:5   warning  Strings must use doublequote                      quotes
     19:12  warning  Strings must use doublequote                      quotes
     20:5   warning  Strings must use doublequote                      quotes
     21:43  warning  Strings must use doublequote                      quotes
     24:12  warning  Strings must use doublequote                      quotes
     25:5   warning  Strings must use doublequote                      quotes
     26:43  warning  Strings must use doublequote                      quotes
     29:12  warning  Strings must use doublequote                      quotes
     30:5   warning  Strings must use doublequote                      quotes
     31:43  warning  Strings must use doublequote                      quotes
     34:12  warning  Strings must use doublequote                      quotes
     35:5   warning  Strings must use doublequote                      quotes
     36:43  warning  Strings must use doublequote                      quotes

   ✖ 17 problems (2 errors, 15 warnings)
     0 errors and 15 warnings potentially fixable with the `--fix` option.
   > Exited with code: 1.
   > Error executing child process: Error: Process exited with code 1.
   Warning: Task "exec:eslint" failed. Use --force to continue.

   Aborted due to warnings.
   #+end_example


* Todo
** uglify do not understend arrow functions...

   
